Revit 2024 API
BuiltInFailures.ViewFailures Class
 Failures about ViewFailures.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ViewFailures
Visual Basic
Public NotInheritable Class ViewFailures
Visual C++
public ref class ViewFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ViewFailures
See Also
BuiltInFailures.ViewFailures Members
Autodesk.Revit.DB Namespace